In [36]:

import getpass
import pandas as pd

In [7]:
import mysql.connector as connector

In [18]:
connection = connector.connect(username = "root",
                               password = getpass.getpass("Password:"),
                               db = "littlelemondb"
)

Password: ········

In [24]:
cursor = connection.cursor()

In [25]:
show_table_query ="SHOW TABLES"
cursor.execute (show_table_query)

In [34]:
show_table_query = "SHOW TABLES"
cursor.execute(show_table_query)
result = cursor.fetchall()
for table in result:
    print(table[0])  # Print table name directly

bookings
customers
employees
locations
menuitems
order_item_history
orderdeliverystatus
orderitems
orders
ordersview
report_to_csv_view

In [30]:
show_db_query = "SELECT DATABASE();"
cursor.execute(show_db_query)
db_name = cursor.fetchone()
print(f"Current database: {db_name}")

Current database: ('littlelemondb',)

In [37]:
cursor.execute("""SELECT CustomerName, FROM customers c
JOIN orders o ON c.CustomerID = o.CustomerID""")
columns = cursor.column_names
results = cursor.fetchall()
df = pd.DataFrame(results, columns=columns)
print(df)

    CustomerID     CustomerName      PhoneNo                     Email  \
0            1  Aisha Abdullahi  08012345678         aisha@example.com
1            1  Aisha Abdullahi  08012345678         aisha@example.com
2            1  Aisha Abdullahi  08012345678         aisha@example.com
3            1  Aisha Abdullahi  08012345678         aisha@example.com
4            2  Olamide Olawale  07098765432       olamide@example.com
5            2  Olamide Olawale  07098765432       olamide@example.com
6            3   Chinelo Chukwu  09087654321       chinelo@example.com
7            3   Chinelo Chukwu  09087654321       chinelo@example.com
8            4     Nneoma Nwosu  08076543210        nneoma@example.com
9            5     Bola Balogun  07065432109          bola@example.com
10           6     Funmi Falola  09054321098         funmi@example.com
11           7     Mateo Garcia  08012345678         mateo@example.com
12           8    Lusungu Banda  07098765432       lusungu@example.com
13           9     Nour Elsayed  09087654321          nour@example.com
14          10      Chenai Moyo  08076543210        chenai@example.com
15          11      Johan Smith  07065432109         johan@example.com
16          12       Fatou Diop  09054321098         fatou@example.com
17          13       Liam Brown  08043210987          liam@example.com
18          14     Aisha Mwangi  07032109876  aisha.mwangi@example.com
19          15      Sara Jensen  09021098765          sara@example.com
20          16       Yusuf Khan  08010987654         yusuf@example.com
21          17     Thembi Nkosi  07098712345        thembi@example.com
22          18     Amira Hassan  09087623456         amira@example.com
23          19       Kofi Owusu  08076534567          kofi@example.com
24          20   Malaika Pierre  07065445678       malaika@example.com
25          21     Diego Rivera  09054356789         diego@example.com
26          22       Emily Chen   4151234567         emily@example.com
27          23     James Wilson   2129876543         james@example.com
28          24   Sophie Laurent   5147654321        sophie@example.com

    EmployeeID  location_id  OrderID   OrderDate Total_Cost  StatusID  \
0            1            1     1001  2020-01-01       3500         1
1            1            1     1003  2020-01-03       1500         1
2            1            1     1006  2020-01-06       2000         2
3            1            1     1009  2020-01-09       2500         2
4            2            2     1002  2020-01-02       5000         2
5            2            2     1005  2020-01-05       4000         1
6            3            3     1004  2020-01-04       2500         3
7            3            3     1007  2020-01-07       3000         3
8            4            4     1008  2020-01-08       4500         1
9            5            5     1010  2020-01-10       1200         1
10           6            6     1011  2020-01-11       1800         2
11           1            7     1012  2020-01-12       3200         1
12           2            8     1013  2020-01-13       2800         3
13           3            9     1014  2020-01-14       1900         1
14           4           10     1015  2020-01-15       2100         2
15           5           11     1016  2020-01-16       3500         1
16           6           12     1017  2020-01-17       1500         3
17           1           13     1018  2020-01-18       2200         1
18           2           14     1019  2020-01-19       3800         2
19           3           15     1020  2020-01-20       1400         1
20           4           16     1021  2020-01-21       2600         3
21           5           17     1022  2020-01-22       3000         1
22           6           18     1023  2020-01-23       1600         2
23           1           19     1024  2020-01-24       4000         1
24           2           20     1025  2020-01-25       2000         2
25           3           21     1026  2020-01-26       3400         1
26           1            1     1027  2020-01-27       1100         3
27           2            2     1028  2020-01-28       2900         1
28           1            4     1029  2020-01-29       2300         2

    CustomerID
0            1
1            1
2            1
3            1
4            2
5            2
6            3
7            3
8            4
9            5
10           6
11           7
12           8
13           9
14          10
15          11
16          12
17          13
18          14
19          15
20          16
21          17
22          18
23          19
24          20
25          21
26          22
27          23
28          24

In [38]:
cursor.execute("""SELECT c.CustomerName, o.Total_Cost FROM customers c
JOIN orders o ON c.CustomerID = o.CustomerID WHERE Total_Cost > 60""")
columns = cursor.column_names
results = cursor.fetchall()
df = pd.DataFrame(results, columns=columns)
print(df)

       CustomerName Total_Cost
0   Aisha Abdullahi       3500
1   Olamide Olawale       5000
2   Aisha Abdullahi       1500
3    Chinelo Chukwu       2500
4   Olamide Olawale       4000
5   Aisha Abdullahi       2000
6    Chinelo Chukwu       3000
7      Nneoma Nwosu       4500
8   Aisha Abdullahi       2500
9      Bola Balogun       1200
10     Funmi Falola       1800
11     Mateo Garcia       3200
12    Lusungu Banda       2800
13     Nour Elsayed       1900
14      Chenai Moyo       2100
15      Johan Smith       3500
16       Fatou Diop       1500
17       Liam Brown       2200
18     Aisha Mwangi       3800
19      Sara Jensen       1400
20       Yusuf Khan       2600
21     Thembi Nkosi       3000
22     Amira Hassan       1600
23       Kofi Owusu       4000
24   Malaika Pierre       2000
25     Diego Rivera       3400
26       Emily Chen       1100
27     James Wilson       2900
28   Sophie Laurent       2300